#include <stdio.h>
#include "utils.h"
// 显示炫酷的 logo
void displayLogo() {
  printf("\033[1;32m"); // 设置字体为绿色
  printf("\n");
  printf("                          --- 学生信息管理系统 ---    \n");
  printf("====================================================================="
         "===========\n");
  printf("                         ____  _             _      \n");
  printf("                        / ___|| |_   _ _ __ (_) ___ \n");
  printf("                        \\___ \\| | | | | '_ \\| |/ _ \\\n");
  printf("                         ___) | | |_| | | | | |  __/\n");
  printf("                        |____/|_|\\__,_|_| |_|_|\\___|\n");
  printf("\n");
  printf("                        欢迎来到学生信息管理系统！\n");
  printf("====================================================================="
         "===========\n");
  printf("\033[1;34m"); // 设置字体为绿色
  printf("回车进入系统~~~");
  getchar();
  clearScreen();
}

// 主菜单
void menu() {
  printf("\033[1;32m");
  printf("       ===========================================\n");
  printf("       ==        学生信息管理系统操作栏         ==\n");
  printf("       ===========================================\n");
  printf("\033[0m"); // 重置为默认颜色
  printf("       ==    1. 增加一名学生记录                ==\n");
  printf("       ==    2. 删除指定学生信息（按学号）      ==\n");
  printf("       ==    3. 修改指定学生信息（按学号）      ==\n");
  printf("       ==    4. 查询符合条件的学生（按专业）    ==\n");
  printf("       ==    5. 显示学生管理库中的信息          ==\n");
  printf("       ==    6. 保存数据到文件                  ==\n");
  printf("       ==    7. 退出系统                        ==\n");
  printf("       ===========================================\n");
  printf("       ===========================================\n");
}